In [4]:
import numpy as np 
from sklearn.cluster import KMeans

#random data
# 6 no. of data,   2 features for each
X= np.array([[1,2], [1,4], [1,0], 
           [10,2], [10,4 ], [10,0 ]])


kmeans= KMeans(n_clusters=2, random_state=0).fit(X)
kmeans.labels_ # labels for each

array([1, 1, 1, 0, 0, 0], dtype=int32)

In [6]:
print(kmeans.predict([[0,0], [12,3]]))
print(kmeans.cluster_centers_)# coordinates for each

[1 0]
[[10.  2.]
 [ 1.  2.]]

In [10]:
import pandas as pd
import numpy as np 

X= pd. DataFrame(np.array([5,7,11,13,-5,np.NaN,np.NaN,np.NaN,np.NaN,
                          0,np.NaN,0]).reshape(4,3)) #4 rows, 3 columns

In [11]:
X.columns=['C1', 'C2','C3']

In [12]:
X.describe()

              C1        C2         C3
count   3.000000  2.000000   2.000000
mean    6.000000  1.000000   5.500000
std     6.557439  8.485281   7.778175
min     0.000000 -5.000000   0.000000
25%     2.500000 -2.000000   2.750000
50%     5.000000  1.000000   5.500000
75%     9.000000  4.000000   8.250000
max    13.000000  7.000000  11.000000

In [13]:
X.head()

     C1   C2    C3
0   5.0  7.0  11.0
1  13.0 -5.0   NaN
2   NaN  NaN   NaN
3   0.0  NaN   0.0

In [14]:
#delete
#axis=0 complete row. ,axis=1 complete column

X.dropna(axis=0, thresh=1, inplace=True)

In [15]:
X

     C1   C2    C3
0   5.0  7.0  11.0
1  13.0 -5.0   NaN
3   0.0  NaN   0.0

In [16]:
#update the index

X.reset_index(inplace=True)
X.drop(['index'],axis=1,inplace=True)

In [17]:
X

     C1   C2    C3
0   5.0  7.0  11.0
1  13.0 -5.0   NaN
2   0.0  NaN   0.0

In [30]:
#filling missing values with the mean

from sklearn.impute import SimpleImputer

imp = SimpleImputer(missing_values=np.nan, strategy='mean') #replacing
#mean of the column
R=imp.fit_transform(X) #New X  fit=train X, transform=

In [33]:
X

     C1   C2    C3
0   5.0  7.0  11.0
1  13.0 -5.0   NaN
2   0.0  NaN   0.0

In [35]:
#X.replace(to_replace='NaN', Value=imp)

In [36]:
X2 = pd.DataFrame(
    np.array(['M', 'O-', 'medium',
             'M', 'O-', 'high',
              'F', 'O+', 'high',
              'F', 'AB', 'low',
              'F', 'B+', np.NaN])
              .reshape((5,3)))
X2.columns = ['gender', 'blood_type', 'edu_level']

In [37]:
X2

  gender blood_type edu_level
0      M         O-    medium
1      M         O-      high
2      F         O+      high
3      F         AB       low
4      F         B+       nan

In [39]:
#convert edu_level to numbers(logical order)
#high=2 med=1 low=0 Nan=-1
from sklearn.preprocessing import OrdinalEncoder
encoder= OrdinalEncoder(categories=['low','medium','high']) #what categories we have
cat = pd.Categorical(X2.edu_level,['missing','low','medium','high'], ordered = True)

In [40]:
cat

[medium, high, high, low, NaN]
Categories (4, object): [missing < low < medium < high]

In [41]:
cat.fillna('missing')

[medium, high, high, low, missing]
Categories (4, object): [missing < low < medium < high]

In [44]:
labels, unique =pd.factorize(cat, sort=True)
X2.edu_level    = labels

In [45]:
                                                                                                                                 X2

  gender blood_type  edu_level
0      M         O-          1
1      M         O-          2
2      F         O+          2
3      F         AB          0
4      F         B+         -1

# one-hot encoding

In [49]:
# 

from sklearn.preprocessing import OneHotEncoder

onehot= OneHotEncoder(dtype=np.int) #create one hot encoder , 
nominals=pd.DataFrame(onehot.fit_transform(X2[['gender','blood_type']]).toarray(),
                     
columns = ['F', 'M', 'AB','B+','O+','O-'])

In [50]:
nominals

   F  M  AB  B+  O+  O-
0  0  1   0   0   0   1
1  0  1   0   0   0   1
2  1  0   0   0   1   0
3  1  0   1   0   0   0
4  1  0   0   1   0   0

In [51]:
nominals['edu_level']=X2.edu_level

In [52]:
nominals

   F  M  AB  B+  O+  O-  edu_level
0  0  1   0   0   0   1          1
1  0  1   0   0   0   1          2
2  1  0   0   0   1   0          2
3  1  0   1   0   0   0          0
4  1  0   0   1   0   0         -1